fedorlov/stm32wb05/STM32_BLE/App/hts_app.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    hts_app.c
  * @author  MCD Application Team
  * @brief   hts_app application definition.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "app_common.h"
#include "app_ble.h"
#include "ble.h"
#include "hts_app.h"
#include "hts.h"
#include "stm32_seq.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "conversion.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/

/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

typedef enum
{
  Temm_INDICATION_OFF,
  Temm_INDICATION_ON,
  Int_NOTIFICATION_OFF,
  Int_NOTIFICATION_ON,
  Mei_INDICATION_OFF,
  Mei_INDICATION_ON,
  /* USER CODE BEGIN Service2_APP_SendInformation_t */
  /** NEW **/
  Conv_NOTIFICATION_OFF,
  Conv_NOTIFICATION_ON,
  /** NEW END **/
  /* USER CODE END Service2_APP_SendInformation_t */
  HTS_APP_SENDINFORMATION_LAST
} HTS_APP_SendInformation_t;

typedef struct
{
  HTS_APP_SendInformation_t     Temm_Indication_Status;
  HTS_APP_SendInformation_t     Int_Notification_Status;
  HTS_APP_SendInformation_t     Mei_Indication_Status;
  /* USER CODE BEGIN Service2_APP_Context_t */
  /** NEW **/
  HTS_APP_SendInformation_t     Conv_Notification_Status;
  /** NEW END **/
  HTS_TemperatureValue_t        IntermediateTemperatureChar;
  HTS_TemperatureValue_t        TemperatureMeasurementChar;
  uint16_t                      MeasurementIntervalChar;
  VTIMER_HandleType           TimerIntTemp_Id;
  VTIMER_HandleType           TimerMeasurement_Id;
  VTIMER_HandleType           TimerMeasInt_Id;
  /** NEW **/
  VTIMER_HandleType           TimerConv_Id;
  /** NEW END **/
  /* USER CODE END Service2_APP_Context_t */
  uint16_t              ConnectionHandle;
} HTS_APP_Context_t;

/* Private defines -----------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define DEFAULT_HTS_MEASUREMENT_INTERVAL   (100)  /**< 1s */
#define DEFAULT_TEMPERATURE_TYPE           TT_Armpit
#define NB_SAVED_MEASURES                  10
/** NEW **/
#define DEFAULT_CONVERSION_INTERVAL        (100) /**< 1s, interval for V/I measurements */
/** NEW END **/
/* USER CODE END PD */

/* External variables --------------------------------------------------------*/
/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Private macros ------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
static HTS_APP_Context_t HTS_APP_Context;

uint8_t a_HTS_UpdateCharData[247];

/* USER CODE BEGIN PV */
uint16_t HTS_Temm_interval = DEFAULT_HTS_MEASUREMENT_INTERVAL;
uint16_t HTS_Int_interval = DEFAULT_HTS_MEASUREMENT_INTERVAL;
uint16_t HTS_Mei_interval = DEFAULT_HTS_MEASUREMENT_INTERVAL;
/** NEW **/
uint16_t HTS_Conv_interval = DEFAULT_CONVERSION_INTERVAL;
/** NEW END **/

static HTS_TemperatureValue_t HTS_Measurement[NB_SAVED_MEASURES];
static int8_t HTS_CurrentIndex, HTS_OldIndex;
static uint8_t HTS_FirstMeasurementDone = 0;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
static void HTS_Temm_SendIndication(void);
static void HTS_Int_SendNotification(void);
static void HTS_Mei_SendIndication(void);

/* USER CODE BEGIN PFP */
static void HTS_APP_UpdateMeasurementInterval_timCb(void *arg);
static void HTS_APP_UpdateIntermediateTemperature_timCb(void *arg);
static void HTS_APP_Measurements_timCb(void *arg);

/** NEW **/
static void HTS_APP_UpdateConv_timCb(void* arg);
static void HTS_APP_SendConversions(void);
/** NEW END **/

static void HTS_APP_IntermediateTemperature(void);
static void HTS_APP_MeasurementInterval(void);
static void HTS_APP_Measurement(void);
static void HTS_APP_Update_TimeStamp(void);
static uint32_t HTS_APP_Read_RTC_SSR_SS ( void );
static void HTS_APP_Suppress(void);
static void HTS_APP_Store(void);
/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
void HTS_Notification(HTS_NotificationEvt_t *p_Notification)
{
  /* USER CODE BEGIN Service2_Notification_1 */

  /* USER CODE END Service2_Notification_1 */
  switch(p_Notification->EvtOpcode)
  {
    /* USER CODE BEGIN Service2_Notification_Service2_EvtOpcode */

    /* USER CODE END Service2_Notification_Service2_EvtOpcode */

    case HTS_TEMM_INDICATE_ENABLED_EVT:
      /* USER CODE BEGIN Service2Char1_INDICATE_ENABLED_EVT */
      HAL_RADIO_TIMER_StopVirtualTimer(&HTS_APP_Context.TimerMeasurement_Id);
      HTS_Temm_interval = DEFAULT_HTS_MEASUREMENT_INTERVAL;
      HAL_RADIO_TIMER_StartVirtualTimer(&HTS_APP_Context.TimerMeasurement_Id, HTS_Temm_interval); //DEFAULT_HTS_MEASUREMENT_INTERVAL);
      HTS_APP_Context.Temm_Indication_Status = Temm_INDICATION_ON;
      /* USER CODE END Service2Char1_INDICATE_ENABLED_EVT */
      break;

    case HTS_TEMM_INDICATE_DISABLED_EVT:
      /* USER CODE BEGIN Service2Char1_INDICATE_DISABLED_EVT */
      HAL_RADIO_TIMER_StopVirtualTimer(&HTS_APP_Context.TimerMeasurement_Id);
      HTS_APP_Context.Temm_Indication_Status = Temm_INDICATION_OFF;
      /* USER CODE END Service2Char1_INDICATE_DISABLED_EVT */
      break;

    case HTS_TET_READ_EVT:
      /* USER CODE BEGIN Service2Char2_READ_EVT */

      /* USER CODE END Service2Char2_READ_EVT */
      break;

    case HTS_INT_NOTIFY_ENABLED_EVT:
      /* USER CODE BEGIN Service2Char3_NOTIFY_ENABLED_EVT */
        APP_DBG_MSG("HTS_INT_NOTIFY_ENABLED_EVT\n");
        HTS_APP_Context.Int_Notification_Status = Int_NOTIFICATION_ON;
        HAL_RADIO_TIMER_StopVirtualTimer(&HTS_APP_Context.TimerIntTemp_Id);
        HTS_Int_interval = DEFAULT_HTS_MEASUREMENT_INTERVAL;
        HAL_RADIO_TIMER_StartVirtualTimer(&HTS_APP_Context.TimerIntTemp_Id, HTS_Int_interval);  //DEFAULT_HTS_MEASUREMENT_INTERVAL); 
      /* USER CODE END Service2Char3_NOTIFY_ENABLED_EVT */
      break;

    case HTS_INT_NOTIFY_DISABLED_EVT:
      /* USER CODE BEGIN Service2Char3_NOTIFY_DISABLED_EVT */
        APP_DBG_MSG("HTS_INT_NOTIFY_DISABLED_EVT\n");
        HTS_APP_Context.Int_Notification_Status = Int_NOTIFICATION_OFF;
        HAL_RADIO_TIMER_StopVirtualTimer(&HTS_APP_Context.TimerIntTemp_Id);
      /* USER CODE END Service2Char3_NOTIFY_DISABLED_EVT */
      break;

    case HTS_MEI_READ_EVT:
      /* USER CODE BEGIN Service2Char4_READ_EVT */
        APP_DBG_MSG("HTS_MEI_READ_EVT\n");
        if(p_Notification->RangeInterval != 0)
        {
          HTS_APP_Context.MeasurementIntervalChar = p_Notification->RangeInterval;
          APP_DBG_MSG("HTS_MEI_READ_EVT: %d \n", p_Notification->RangeInterval);
          if(HTS_APP_Context.Mei_Indication_Status != Mei_INDICATION_OFF)
          {
            if(HTS_APP_Context.Temm_Indication_Status == Temm_INDICATION_OFF)
            {
              HTS_Temm_interval = (HTS_APP_Context.MeasurementIntervalChar)*DEFAULT_HTS_MEASUREMENT_INTERVAL;
              HAL_RADIO_TIMER_StartVirtualTimer(&HTS_APP_Context.TimerMeasurement_Id, HTS_Temm_interval);
              HTS_APP_Context.Temm_Indication_Status = Temm_INDICATION_ON;
            }
            else
            {
              HAL_RADIO_TIMER_StopVirtualTimer(&HTS_APP_Context.TimerMeasurement_Id);
              HTS_Temm_interval = (HTS_APP_Context.MeasurementIntervalChar)*DEFAULT_HTS_MEASUREMENT_INTERVAL;
              HAL_RADIO_TIMER_StartVirtualTimer(&HTS_APP_Context.TimerMeasurement_Id, HTS_Temm_interval); 
            }
          }
        }
        else
        {
          HAL_RADIO_TIMER_StopVirtualTimer(&HTS_APP_Context.TimerMeasurement_Id);
          HTS_APP_Context.Temm_Indication_Status = Temm_INDICATION_OFF;
        }
      /* USER CODE END Service2Char4_READ_EVT */
      break;

    case HTS_MEI_WRITE_EVT:
      /* USER CODE BEGIN Service2Char4_WRITE_EVT */

      /* USER CODE END Service2Char4_WRITE_EVT */
      break;

    case HTS_MEI_INDICATE_ENABLED_EVT:
      /* USER CODE BEGIN Service2Char4_INDICATE_ENABLED_EVT */
        APP_DBG_MSG("HTS_MEI_INDICATE_ENABLED_EVT\n");
        HTS_APP_Context.Mei_Indication_Status = Mei_INDICATION_ON;
        HAL_RADIO_TIMER_StopVirtualTimer(&HTS_APP_Context.TimerMeasInt_Id);
        HTS_Mei_interval = 2*DEFAULT_HTS_MEASUREMENT_INTERVAL;
        HAL_RADIO_TIMER_StartVirtualTimer(&HTS_APP_Context.TimerMeasInt_Id, HTS_Mei_interval);  //2*DEFAULT_HTS_MEASUREMENT_INTERVAL);
      /* USER CODE END Service2Char4_INDICATE_ENABLED_EVT */
      break;

    case HTS_MEI_INDICATE_DISABLED_EVT:
      /* USER CODE BEGIN Service2Char4_INDICATE_DISABLED_EVT */
      APP_DBG_MSG("HTS_MEI_INDICATE_DISABLED_EVT\n");
      HTS_APP_Context.Mei_Indication_Status = Mei_INDICATION_OFF;
      HAL_RADIO_TIMER_StopVirtualTimer(&HTS_APP_Context.TimerMeasInt_Id);
      /* USER CODE END Service2Char4_INDICATE_DISABLED_EVT */
      break;

	/** NEW **/
	case HTS_CNV_NOTIFY_ENABLED_EVT:
		APP_DBG_MSG("CNV_NOTIFY_ENABLED_EVT\n");
		HTS_APP_Context.Conv_Notification_Status = Conv_NOTIFICATION_ON;
		HAL_RADIO_TIMER_StopVirtualTimer(&HTS_APP_Context.TimerConv_Id);
		HAL_RADIO_TIMER_StartVirtualTimer(&HTS_APP_Context.TimerConv_Id, HTS_Conv_interval);
		break;

	case HTS_CNV_NOTIFY_DISABLED_EVT:
		APP_DBG_MSG("CNV_NOTIFY_DISABLED_EVT\n");
		HTS_APP_Context.Conv_Notification_Status = Conv_NOTIFICATION_OFF;
		HAL_RADIO_TIMER_StopVirtualTimer(&HTS_APP_Context.TimerConv_Id);
		break;
    /** NEW END **/

    default:
      /* USER CODE BEGIN Service2_Notification_default */

