fedorlov/stm32wb05/STM32_BLE/App/hts_app.c
      /* USER CODE END Service2_Notification_default */
      break;
  }
  /* USER CODE BEGIN Service2_Notification_2 */

  /* USER CODE END Service2_Notification_2 */
  return;
}

void HTS_APP_EvtRx(HTS_APP_ConnHandleNotEvt_t *p_Notification)
{
  /* USER CODE BEGIN Service2_APP_EvtRx_1 */

  /* USER CODE END Service2_APP_EvtRx_1 */

  switch(p_Notification->EvtOpcode)
  {
    /* USER CODE BEGIN Service2_APP_EvtRx_Service2_EvtOpcode */

    /* USER CODE END Service2_APP_EvtRx_Service2_EvtOpcode */
    case HTS_CONN_HANDLE_EVT :
      HTS_APP_Context.ConnectionHandle = p_Notification->ConnectionHandle;
      /* USER CODE BEGIN Service2_APP_CENTR_CONN_HANDLE_EVT */

      /* USER CODE END Service2_APP_CENTR_CONN_HANDLE_EVT */
      break;
    case HTS_DISCON_HANDLE_EVT :
      HTS_APP_Context.ConnectionHandle = 0xFFFF;
      /* USER CODE BEGIN Service2_APP_DISCON_HANDLE_EVT */
      HAL_RADIO_TIMER_StopVirtualTimer(&(HTS_APP_Context.TimerMeasurement_Id));
      HAL_RADIO_TIMER_StopVirtualTimer(&(HTS_APP_Context.TimerIntTemp_Id));
      HAL_RADIO_TIMER_StopVirtualTimer(&(HTS_APP_Context.TimerMeasInt_Id));
	  /** NEW **/
	  HAL_RADIO_TIMER_StopVirtualTimer(&(HTS_APP_Context.TimerConv_Id));
	  /** NEW END **/
      /* USER CODE END Service2_APP_DISCON_HANDLE_EVT */
      break;

    default:
      /* USER CODE BEGIN Service2_APP_EvtRx_default */

      /* USER CODE END Service2_APP_EvtRx_default */
      break;
  }

  /* USER CODE BEGIN Service2_APP_EvtRx_2 */

  /* USER CODE END Service2_APP_EvtRx_2 */

  return;
}

void HTS_APP_Init(void)
{
  HTS_APP_Context.ConnectionHandle = 0xFFFF;
  HTS_Init();

  /* USER CODE BEGIN Service2_APP_Init */
  HTS_Data_t msg_conf;

  UTIL_SEQ_RegTask( 1<< CFG_TASK_HTS_MEAS_REQ_ID, UTIL_SEQ_RFU, HTS_APP_Measurement);
  UTIL_SEQ_RegTask( 1<< CFG_TASK_HTS_MEAS_INTERVAL_REQ_ID, UTIL_SEQ_RFU, HTS_APP_MeasurementInterval);
  UTIL_SEQ_RegTask( 1<< CFG_TASK_HTS_INTERMEDIATE_TEMPERATURE_REQ_ID, UTIL_SEQ_RFU, HTS_APP_IntermediateTemperature);

  /** NEW **/
  UTIL_SEQ_RegTask(1 << CFG_TASK_HTS_CNV_REQ_ID, UTIL_SEQ_RFU, HTS_APP_SendConversions);
  /** NEW END **/
  /**
   * Initialize Flags
   */
  HTS_APP_Context.TemperatureMeasurementChar.Flags = (uint8_t)NO_FLAGS;
  HTS_APP_Context.IntermediateTemperatureChar.Flags = (uint8_t)NO_FLAGS;

  HTS_APP_Context.TemperatureMeasurementChar.Flags |= (uint8_t)SENSOR_TIME_STAMP_PRESENT;
  HTS_APP_Context.IntermediateTemperatureChar.Flags |= (uint8_t)SENSOR_TIME_STAMP_PRESENT;
  HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Year = 2023;
  HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Month = 4;
  HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Day = 1;
  HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Hours = 0;
  HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Minutes = 0;
  HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Seconds  = 0;

  /**
   * Initialize Measurement Interval
   */
  msg_conf.Length = 1;
  if(BLE_CFG_HTS_TEMPERATURE_INTERVAL_MIN_VALUE == 0)
      a_HTS_UpdateCharData[0] = BLE_CFG_HTS_TEMPERATURE_INTERVAL_MIN_VALUE + 3;
  else
      a_HTS_UpdateCharData[0] = BLE_CFG_HTS_TEMPERATURE_INTERVAL_MIN_VALUE + 2;

  HTS_APP_Context.Mei_Indication_Status = Mei_INDICATION_OFF;
  msg_conf.p_Payload = a_HTS_UpdateCharData;
  HTS_UpdateValue(HTS_MEI, &msg_conf);
  /**
   * Create timer for Health Temperature Measurement Interval
   */
  HTS_APP_Context.TimerMeasInt_Id.callback = HTS_APP_UpdateMeasurementInterval_timCb;

  /**
   * Set Temperature Measurement Type
   */
  HTS_APP_Context.TemperatureMeasurementChar.TemperatureType = DEFAULT_TEMPERATURE_TYPE;
  HTS_APP_Context.TemperatureMeasurementChar.Flags |= (uint8_t)SENSOR_TEMPERATURE_TYPE_PRESENT;
  HTS_APP_Context.IntermediateTemperatureChar.Flags |= (uint8_t)SENSOR_TEMPERATURE_TYPE_PRESENT;
  HTS_APP_Context.Int_Notification_Status = Int_NOTIFICATION_OFF;

  /**
   * Create timer for Health Temperature Measurement
   */
  HTS_APP_Context.TimerMeasurement_Id.callback = HTS_APP_Measurements_timCb;
  HTS_APP_Context.Temm_Indication_Status = Temm_INDICATION_OFF;

  /**
   * Create timer for Health Temperature Intermediate Temperature
   */
  HTS_APP_Context.TimerIntTemp_Id.callback = HTS_APP_UpdateIntermediateTemperature_timCb;

  /** NEW **/
  /**
   * Create timers for Voltage and Current
   */
  HTS_APP_Context.TimerConv_Id.callback = HTS_APP_UpdateConv_timCb;
  HTS_APP_Context.Conv_Notification_Status = Conv_NOTIFICATION_OFF;
  /** NEW END **/

  HTS_CurrentIndex = -1;
  HTS_OldIndex = 0;

  /* USER CODE END Service2_APP_Init */
  return;
}

/* USER CODE BEGIN FD */
static void HTS_APP_UpdateMeasurementInterval_timCb(void *arg)
{
  /**
   * The code shall be executed in the background as aci command may be sent
   * The background is the only place where the application can make sure a new aci command
   * is not sent if there is a pending one
   */
  UTIL_SEQ_SetTask( 1<<CFG_TASK_HTS_MEAS_INTERVAL_REQ_ID,CFG_SEQ_PRIO_0);
  HAL_RADIO_TIMER_StartVirtualTimer(&HTS_APP_Context.TimerMeasInt_Id, HTS_Mei_interval);
  return;
}

static void HTS_APP_Measurements_timCb(void *arg)
{
  /**
   * The code shall be executed in the background as aci command may be sent
   * The background is the only place where the application can make sure a new aci command
   * is not sent if there is a pending one
   */
  UTIL_SEQ_SetTask(1<<CFG_TASK_HTS_MEAS_REQ_ID, CFG_SEQ_PRIO_0);
  HAL_RADIO_TIMER_StartVirtualTimer(&HTS_APP_Context.TimerMeasurement_Id, HTS_Temm_interval);
  return;
}

static void HTS_APP_UpdateIntermediateTemperature_timCb(void *arg)
{
  /**
   * The code shall be executed in the background as aci command may be sent
   * The background is the only place where the application can make sure a new aci command
   * is not sent if there is a pending one
   */
  UTIL_SEQ_SetTask( 1<<CFG_TASK_HTS_INTERMEDIATE_TEMPERATURE_REQ_ID, CFG_SEQ_PRIO_0);
  HAL_RADIO_TIMER_StartVirtualTimer(&HTS_APP_Context.TimerIntTemp_Id, HTS_Int_interval);
  return;
}

/** NEW **/
static void HTS_APP_UpdateConv_timCb(void* arg)
{
	UTIL_SEQ_SetTask(1 << CFG_TASK_HTS_CNV_REQ_ID, CFG_SEQ_PRIO_0);
	HAL_RADIO_TIMER_StartVirtualTimer(&HTS_APP_Context.TimerConv_Id, HTS_Conv_interval);
}
/** NEW END **/
/* USER CODE END FD */

