fedorlov/stm32wb05/STM32_BLE/App/hts_app.c
static void HTS_APP_IntermediateTemperature(void)
{
  tBleStatus ret;
  HTS_Data_t msg_conf;
  uint8_t atm_value[
                    1 +         /* Flags */
                    4 +         /* MeasurementValue */
                    7 +         /* TimeStamp */
                    1           /* TemperatureType */
                    ];
  uint8_t tm_char_length;  

  HTS_APP_Context.IntermediateTemperatureChar.MeasurementValue = (uint32_t)(conv.U * 100); //((HTS_APP_Read_RTC_SSR_SS()) + 37);

  if(HTS_APP_Context.Int_Notification_Status == Int_NOTIFICATION_ON)
  {
    APP_DBG_MSG("HTS_APP_IntermediateTemperature: %d \n", HTS_APP_Context.IntermediateTemperatureChar.MeasurementValue);
    /**
     * Flags update
     */
    atm_value[0] = (uint8_t)HTS_APP_Context.IntermediateTemperatureChar.Flags;

    /**
     *  Intermediate Temperature Measurement Value
     */
    atm_value[1] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.MeasurementValue);
    atm_value[2] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.MeasurementValue >> 8);
    atm_value[3] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.MeasurementValue >> 16);
    atm_value[4] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.MeasurementValue >> 24);

    tm_char_length = 5;

    if (HTS_APP_Context.IntermediateTemperatureChar.Flags &  SENSOR_TIME_STAMP_PRESENT)
    {
      atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.TimeStamp.Year);
      tm_char_length++;
      atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.TimeStamp.Year >> 8);
      tm_char_length++;
      atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.TimeStamp.Month);
      tm_char_length++;
      atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.TimeStamp.Day);
      tm_char_length++;
      atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.TimeStamp.Hours);
      tm_char_length++;
      atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.TimeStamp.Minutes);
      tm_char_length++;
      atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.TimeStamp.Seconds);
      tm_char_length++;
    }

    atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.TemperatureType);
    tm_char_length++;

    /**
     * Update Intermediate Temperature Measurement Value
     */
    msg_conf.p_Payload = atm_value;
    msg_conf.Length = tm_char_length;
    HTS_UpdateValue(HTS_INT, &msg_conf);
    ret = HTS_NotifyValue(HTS_INT, &msg_conf, HTS_APP_Context.ConnectionHandle);
    if(ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("HTS_NotifyValue fails\n");
    }
  }
  return;
}

static void HTS_APP_MeasurementInterval(void)
{
  tBleStatus ret;
  HTS_Data_t msg_conf;
  uint8_t htm_char_length = 0;

  if(HTS_APP_Context.MeasurementIntervalChar < BLE_CFG_HTS_TEMPERATURE_INTERVAL_MAX_VALUE)
    HTS_APP_Context.MeasurementIntervalChar += 1;
  else
    HTS_APP_Context.MeasurementIntervalChar = BLE_CFG_HTS_TEMPERATURE_INTERVAL_MIN_VALUE;
  APP_DBG_MSG("Measurement Interval: %d \n", 
                  HTS_APP_Context.MeasurementIntervalChar);

  a_HTS_UpdateCharData[htm_char_length] = (uint8_t)(HTS_APP_Context.MeasurementIntervalChar & 0xFF);
  htm_char_length++;
  a_HTS_UpdateCharData[htm_char_length] = (uint8_t)(HTS_APP_Context.MeasurementIntervalChar >> 8);
  htm_char_length++;

  /**
   * Update Measurement Interval Value
   */
  msg_conf.p_Payload = a_HTS_UpdateCharData;
  msg_conf.Length = htm_char_length;
  HTS_UpdateValue(HTS_MEI, &msg_conf);
  ret = HTS_NotifyValue(HTS_MEI, &msg_conf, HTS_APP_Context.ConnectionHandle);
  if(ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("HTS_NotifyValue fails\n");
  }
  return;
}

static uint32_t HTS_APP_Read_RTC_SSR_SS ( void )
{ 
  uint8_t rand_num[8];
  
  hci_le_rand(rand_num);
  return ((uint32_t) (rand_num[0] % 4));
}

static void HTS_APP_Update_TimeStamp(void)
{
  HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Seconds += 
    10 * HTS_APP_Context.MeasurementIntervalChar;
  
  while(HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Seconds >= 60)
  {
    HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Seconds -= 60;
    HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Minutes += 1;
  }
  while(HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Minutes >= 60)
  {
    HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Minutes -= 60;
    HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Hours += 1;
  }
  while(HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Hours >= 24)
  {
    HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Hours -= 24;
    HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Day += 1;
  }
  while(HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Day >= 31)
  {
    HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Day -= 31;
    HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Month += 1;
  }
  while(HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Month >= 12)
  {
    HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Month -= 11;
    HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Year += 1;
  }
}

static void HTS_APP_Store(void)
{
  HTS_CurrentIndex++;
  if(HTS_CurrentIndex == NB_SAVED_MEASURES)
  {
    HTS_CurrentIndex = 0;
  }
  if((HTS_CurrentIndex == HTS_OldIndex) && (HTS_Measurement[HTS_CurrentIndex].MeasurementValue > 0))
  {
    HTS_OldIndex = HTS_CurrentIndex + 1;
    if(HTS_OldIndex == NB_SAVED_MEASURES)
    {
      HTS_OldIndex = 0;
    }
  }
  APP_DBG_MSG ("Stored measurement %d, index of first measure saved: %d\n", 
               HTS_Measurement[HTS_CurrentIndex].MeasurementValue, HTS_OldIndex);  
  memcpy(&HTS_Measurement[HTS_CurrentIndex], 
         &(HTS_APP_Context.TemperatureMeasurementChar), 
         sizeof(HTS_TemperatureValue_t)); 
}

static void HTS_APP_Suppress(void)
{
  tBleStatus ret;
  HTS_Data_t msg_conf;
  uint8_t htm_char_length = 0;

  a_HTS_UpdateCharData[htm_char_length] = (uint8_t)(HTS_Measurement[HTS_OldIndex].MeasurementValue);
  htm_char_length++;
  /**
   * Update Temperature Measurement Value
   */
  msg_conf.p_Payload = a_HTS_UpdateCharData;
  msg_conf.Length = htm_char_length;
  HTS_UpdateValue(HTS_TEMM, &msg_conf);
  ret = HTS_NotifyValue(HTS_TEMM, &msg_conf, HTS_APP_Context.ConnectionHandle);
  if(ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("HTS_NotifyValue fails\n");
  }

  HTS_Measurement[HTS_OldIndex].MeasurementValue = 0;
  HTS_OldIndex++;
  if(HTS_OldIndex == NB_SAVED_MEASURES)
  {
    HTS_OldIndex = 0;
  }
}
/* USER CODE END FD_LOCAL_FUNCTIONS*/
